; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-58)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 - object)
 (:init 
    (arm-empty)
    (clear b1)
    (on b1 b11)
    (on-table b11)
    (clear b3)
    (on b3 b9)
    (on b9 b2)
    (on b2 b12)
    (on b12 b5)
    (on b5 b17)
    (on b17 b13)
    (on b13 b10)
    (on b10 b15)
    (on b15 b8)
    (on b8 b14)
    (on b14 b16)
    (on b16 b6)
    (on b6 b4)
    (on b4 b7)
    (on-table b7))
 (:goal (and 
(on-table b1)
(on b13 b1)
(on b10 b13)
(on b3 b10)
(on b9 b3)
(on b11 b9)
))
)

; plan
1. (unstack b1 b11)
   deleted: (on b1 b11) (clear b1) (arm-empty)
   added: (holding b1) (clear b11)
   goals met: 0 of 6
2. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 1 of 6
3. (unstack b3 b9)
   deleted: (on b3 b9) (clear b3) (arm-empty)
   added: (holding b3) (clear b9)
   goals met: 1 of 6
4. (stack b3 b11)
   deleted: (clear b11) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b11)
   goals met: 1 of 6
5. (unstack b9 b2)
   deleted: (on b9 b2) (clear b9) (arm-empty)
   added: (holding b9) (clear b2)
   goals met: 1 of 6
6. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 1 of 6
7. (unstack b2 b12)
   deleted: (on b2 b12) (clear b2) (arm-empty)
   added: (holding b2) (clear b12)
   goals met: 1 of 6
8. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 1 of 6
9. (unstack b12 b5)
   deleted: (on b12 b5) (clear b12) (arm-empty)
   added: (holding b12) (clear b5)
   goals met: 1 of 6
10. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 1 of 6
11. (unstack b5 b17)
   deleted: (on b5 b17) (clear b5) (arm-empty)
   added: (holding b5) (clear b17)
   goals met: 1 of 6
12. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 1 of 6
13. (unstack b17 b13)
   deleted: (on b17 b13) (clear b17) (arm-empty)
   added: (holding b17) (clear b13)
   goals met: 1 of 6
14. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 1 of 6
15. (unstack b13 b10)
   deleted: (on b13 b10) (clear b13) (arm-empty)
   added: (holding b13) (clear b10)
   goals met: 1 of 6
16. (stack b13 b1)
   deleted: (clear b1) (holding b13)
   added: (arm-empty) (clear b13) (on b13 b1)
   goals met: 2 of 6
17. (unstack b10 b15)
   deleted: (on b10 b15) (clear b10) (arm-empty)
   added: (holding b10) (clear b15)
   goals met: 2 of 6
18. (stack b10 b13)
   deleted: (clear b13) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b13)
   goals met: 3 of 6
19. (unstack b3 b11)
   deleted: (on b3 b11) (clear b3) (arm-empty)
   added: (holding b3) (clear b11)
   goals met: 3 of 6
20. (stack b3 b10)
   deleted: (clear b10) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b10)
   goals met: 4 of 6
21. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 4 of 6
22. (stack b9 b3)
   deleted: (clear b3) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b3)
   goals met: 5 of 6
23. (pickup b11)
   deleted: (clear b11) (on-table b11) (arm-empty)
   added: (holding b11)
   goals met: 5 of 6
24. (stack b11 b9)
   deleted: (clear b9) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b9)
   goals met: 6 of 6
